Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ФизическиеЛица.ДатаРождения КАК ДатаРождения
                      |ИЗ
                      |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
                      |		ПО ИнформационныеКарты.ВладелецКарты = ФизическиеЛица.Ссылка
                      |ГДЕ
                      |	ИнформационныеКарты.Ссылка = &Карта
                      |
                      |ОБЪЕДИНИТЬ ВСЕ
                      |
                      |ВЫБРАТЬ
                      |	ФизическиеЛица.ДатаРождения
                      |ИЗ
                      |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
                      |		ПО ИнформационныеКарты.ВладелецКарты = Пользователи.Ссылка
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
                      |		ПО Пользователи.ФизическоеЛицо = ФизическиеЛица.Ссылка
                      |ГДЕ
                      |	ИнформационныеКарты.Ссылка = &Карта");

Запрос.УстановитьПараметр("Карта", Карта);
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Результат = Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy");
Иначе
	Результат = "";
КонецЕсли;
