Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                      |	Штрихкоды.Штрихкод КАК Штрихкод
                      |ИЗ
                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнформационныеКарты КАК ИнформационныеКарты
                      |		ПО Штрихкоды.Владелец = ИнформационныеКарты.Ссылка
                      |ГДЕ
                      |	ИнформационныеКарты.Ссылка = &Карта");

Запрос.УстановитьПараметр("Карта", Карта);
Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Результат = СокрЛП(Выборка.Штрихкод);
Иначе
	Результат = "";
КонецЕсли;
