//Использовать крайне оснорожно, т.к. вызывает значительную нагрузку на систему 1С и сервис ОСМИ

Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ИнформационныеКарты.Ссылка КАК Карта
                      |ИЗ
                      |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОСМИ_СоответствиеКарт КАК ОСМИ_СоответствиеКарт
                      |		ПО ИнформационныеКарты.Ссылка = ОСМИ_СоответствиеКарт.ОбъектБазы"); 

Выборка = Запрос.Выполнить().Выбрать(); 
Пока Выборка.Следующий() Цикл 
	Результат.Добавить(Выборка.Карта) 
КонецЦикла;