//Данные выбираются из табличной части "Контактная информация" справочника "Партнеры"

Запрос = Новый Запрос; 
Запрос.Текст = "ВЫБРАТЬ
               |	КартыЛояльности.Ссылка КАК Ссылка,
               |	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
               |ИЗ
               |	Справочник.КартыЛояльности КАК КартыЛояльности
               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
               |		ПО КартыЛояльности.Партнер = ПартнерыКонтактнаяИнформация.Ссылка
               |ГДЕ
               |	КартыЛояльности.Ссылка = &Карта
               |	И ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)"; 
Запрос.УстановитьПараметр("Карта",Карта);
Выб = Запрос.Выполнить().выбрать(); 
Если Выб.Следующий() Тогда 
	Результат = Выб.НомерТелефона; 
КонецЕсли; 	
